<?xml version="1.0" encoding="UTF-8"?><rss xmlns:dc="http://purl.org/dc/elements/1.1/" xmlns:content="http://purl.org/rss/1.0/modules/content/" xmlns:atom="http://www.w3.org/2005/Atom" version="2.0" xmlns:media="http://search.yahoo.com/mrss/"><channel><title><![CDATA[Matheus Gustavo]]></title><description><![CDATA[Software Engineer | Tech Lead]]></description><link>https://www.matheusgustavo.com.br/</link><image><url>https://www.matheusgustavo.com.br/favicon.png</url><title>Matheus Gustavo</title><link>https://www.matheusgustavo.com.br/</link></image><generator>Ghost 6.0</generator><lastBuildDate>Sun, 02 Nov 2025 01:09:41 GMT</lastBuildDate><atom:link href="https://www.matheusgustavo.com.br/rss/" rel="self" type="application/rss+xml"/><ttl>60</ttl><item><title><![CDATA[O papel do DDD em conectar tecnologia e negócio]]></title><description><![CDATA[<p>Em diversas empresas e projetos pelos quais passei, percebi que o time de engenharia de software costuma assumir um grande protagonismo no desenvolvimento do produto. Muitas vezes, s&#xE3;o os desenvolvedores que mais conhecem o funcionamento do sistema &#x2014; seus fluxos e poss&#xED;veis falhas.</p><p>Al&#xE9;m</p>]]></description><link>https://www.matheusgustavo.com.br/precisamos-de-mais-ddd-na-engenharia-de-software/</link><guid isPermaLink="false">690553995cef21b3115933a7</guid><category><![CDATA[Sobre Software]]></category><dc:creator><![CDATA[Matheus Gustavo]]></dc:creator><pubDate>Sat, 01 Nov 2025 01:30:34 GMT</pubDate><content:encoded><![CDATA[<p>Em diversas empresas e projetos pelos quais passei, percebi que o time de engenharia de software costuma assumir um grande protagonismo no desenvolvimento do produto. Muitas vezes, s&#xE3;o os desenvolvedores que mais conhecem o funcionamento do sistema &#x2014; seus fluxos e poss&#xED;veis falhas.</p><p>Al&#xE9;m disso, n&#xE3;o &#xE9; raro que a complexidade t&#xE9;cnica acabe ofuscando a complexidade do neg&#xF3;cio. Em muitos casos, a equipe de engenharia subestima a import&#xE2;ncia de dialogar com os especialistas do dom&#xED;nio, buscar clareza nos fluxos ou compreender profundamente as regras de neg&#xF3;cio que realmente movem o produto.</p><p>Por outro lado, os especialistas de neg&#xF3;cio acabam influenciados, passam a falar a linguagem da engenharia e limitam suas ideias com base em restri&#xE7;&#xF5;es t&#xE9;cnicas, sem desafiar a tecnologia a resolver o problema de alguma forma criativa.</p><p>Sem clareza nas regras de neg&#xF3;cio, uma linguagem comum e entendimento compartilhado dos contextos, a engenharia corre o risco de modelar sistemas, APIs e estruturas de dados que n&#xE3;o refletem, da melhor maneira, o problema de neg&#xF3;cio &#x2014; o que dificulta o entendimento e a evolu&#xE7;&#xE3;o do produto. E, &#xE0; medida que o sistema cresce, mais dif&#xED;cil se torna adicionar novas funcionalidades.</p><p>&#xC9; justamente nesse ponto que o Domain-Driven Design (DDD) se torna uma ferramenta essencial. Criado por Eric Evans em 2003, o DDD prop&#xF5;e que o software seja constru&#xED;do a partir do dom&#xED;nio de neg&#xF3;cio &#x2014; n&#xE3;o da tecnologia. Ele defende a colabora&#xE7;&#xE3;o constante entre desenvolvedores e especialistas, o uso de uma linguagem ub&#xED;qua (comum a todos) e a separa&#xE7;&#xE3;o entre o n&#xFA;cleo do dom&#xED;nio e as preocupa&#xE7;&#xF5;es t&#xE9;cnicas.</p><p>Aplicar DDD &#xE9; mais do que seguir padr&#xF5;es de design: &#xE9; adotar uma nova mentalidade. Significa colocar o entendimento do neg&#xF3;cio no centro do processo de desenvolvimento.</p><p>Sistemas orientados ao dom&#xED;nio s&#xE3;o mais coerentes, f&#xE1;ceis de evoluir e de manter. O c&#xF3;digo deixa de ser apenas uma solu&#xE7;&#xE3;o t&#xE9;cnica e passa a representar a ess&#xEA;ncia do neg&#xF3;cio.</p><p>Por&#xE9;m, o ganho n&#xE3;o &#xE9; apenas no c&#xF3;digo e no sistema, mas tamb&#xE9;m no time, que fica mais fluente no neg&#xF3;cio, mantendo uma linguagem compartilhada que reduz o risco de ru&#xED;dos de comunica&#xE7;&#xE3;o.</p><p>O DDD nos lembra que a tecnologia existe para servir ao neg&#xF3;cio &#x2014; e que, no fim das contas, a complexidade t&#xE9;cnica s&#xF3; existe para resolver a complexidade do dom&#xED;nio.</p><p>Aprender DDD &#xE9; mais do que dominar uma t&#xE9;cnica: &#xE9; mudar a forma como enxergamos o software. Ao compreender o dom&#xED;nio e colocar o neg&#xF3;cio no centro, criamos produtos mais s&#xF3;lidos, relevantes e sustent&#xE1;veis. No fim, o verdadeiro diferencial de um bom desenvolvedor est&#xE1; em entender o problema que o c&#xF3;digo precisa resolver.</p>]]></content:encoded></item><item><title><![CDATA[Sobre o sentido da vida]]></title><description><![CDATA[<blockquote>Adormeci e sonhei que a vida era alegria; despertei e vi que a vida era servi&#xE7;o; servi e vi que o servi&#xE7;o era uma alegria.<br><strong>Rabindranath Tagore</strong></blockquote><p>Viktor Frankl &#xE9; conhecido principalmente por seu livro <em><strong>Em Busca de Sentido</strong></em> (<em>Man&#x2019;s Search for Meaning</em>), no</p>]]></description><link>https://www.matheusgustavo.com.br/sobre-o-sentido-da-vida/</link><guid isPermaLink="false">68c7f35fe7a49a5768b7e1dc</guid><category><![CDATA[Bem Estar]]></category><dc:creator><![CDATA[Matheus Gustavo]]></dc:creator><pubDate>Mon, 15 Sep 2025 11:21:59 GMT</pubDate><content:encoded><![CDATA[<blockquote>Adormeci e sonhei que a vida era alegria; despertei e vi que a vida era servi&#xE7;o; servi e vi que o servi&#xE7;o era uma alegria.<br><strong>Rabindranath Tagore</strong></blockquote><p>Viktor Frankl &#xE9; conhecido principalmente por seu livro <em><strong>Em Busca de Sentido</strong></em> (<em>Man&#x2019;s Search for Meaning</em>), no qual ele explora profundamente a quest&#xE3;o do <strong>sentido da vida</strong> a partir de sua experi&#xEA;ncia como prisioneiro em campos de concentra&#xE7;&#xE3;o nazistas.</p><p>O livro <strong><em>Sobre o Sentido da Vida</em></strong>, diferente de <strong><em>Em Busca de Sentido</em></strong>, &#xE9; uma obra mais concisa e direta, baseada em <strong>palestras e reflex&#xF5;es</strong> que Frankl fez ao longo da vida, com foco espec&#xED;fico na quest&#xE3;o do sentido da exist&#xEA;ncia humana.</p><p>Para Viktor Frankl, a felicidade n&#xE3;o pode nem deve ser objetivo, mas apenas o resultado.<br><br>N&#xE3;o devemos esperar nada da vida, e sim nos perguntar: O que a vida espera de mim? Que tarefas esperam por mim na vida? A pr&#xF3;pria vida nada mais &#xE9; que ser indagado, todo nosso ser nada mais &#xE9; que um responder &#x2013; um responder e responsabilizar-se pela vida.</p><p>&#x201C;Se eu n&#xE3;o o fa&#xE7;o &#x2013; quem mais o far&#xE1;? Se, por&#xE9;m, fa&#xE7;o apenas por mim &#x2013; o que sou ent&#xE3;o?&#x201D;</p><p>A vida em si significa ser indagado, significa responder &#x2013; justificar sua pr&#xF3;pria exist&#xEA;ncia. Assim, a vida n&#xE3;o &#xE9; uma circunst&#xE2;ncia, mas uma incumb&#xEA;ncia &#x2013; ela &#xE9;, em cada momento, tarefa.</p><p>&#x201C;A vida n&#xE3;o &#xE9; algo; &#xE9; a oportunidade para algo!&#x201D;</p><p>Nessa concep&#xE7;&#xE3;o, agora nada pode continuar a nos atemorizar, nenhum futuro, nenhuma aparente aus&#xEA;ncia de futuro.&#xA0;<strong>Pois agora o presente &#xE9; tudo</strong>, pois ele recupera a eternamente nova quest&#xE3;o da vida dirigida a n&#xF3;s.</p><p>&#xC9; tamb&#xE9;m na maneira como nos comportamos diante das dificuldades que se revela quem somos.</p><p>O ser humano pode dar sentido a sua exist&#xEA;ncia, em primeiro lugar, ao fazer alguma coisa, ao agir, ao criar algo &#x2013; ao realizar uma obra. Em segundo lugar ao vivenciar algo &#x2013; amar a natureza, a arte, as pessoas. E, em terceiro lugar ao valorizar a sua vida, encontrar nela um valor &#x2013; justamente quando toma uma posi&#xE7;&#xE3;o diante das imut&#xE1;veis, fat&#xED;dicas, incontorn&#xE1;veis e inelud&#xED;veis limita&#xE7;&#xF5;es de suas possibilidades, na maneira como se posiciona e se comporta em rela&#xE7;&#xE3;o a elas, como assume sobre si esse destino.</p><p>Dizer sim para a vida &#xE9; algo pleno de sentido &#x2013; a vida em si o &#xE9;.</p><p><strong>Para saber mais:</strong><br><a href="https://www.amazon.com.br/Sobre-sentido-vida-Viktor-Frankl/dp/655713387X/ref=asc_df_655713387X/?tag=googleshopp00-20&amp;linkCode=df0&amp;hvadid=709856848269&amp;hvpos=&amp;hvnetw=g&amp;hvrand=12929712228063584700&amp;hvpone=&amp;hvptwo=&amp;hvqmt=&amp;hvdev=c&amp;hvdvcmdl=&amp;hvlocint=&amp;hvlocphy=9100340&amp;hvtargid=pla-1570391634419&amp;psc=1&amp;mcid=71fa7821e1783555876c5adca8cb2327&amp;tag=googleshopp00-20&amp;linkCode=df0&amp;hvadid=709856848269&amp;hvpos=&amp;hvnetw=g&amp;hvrand=12929712228063584700&amp;hvpone=&amp;hvptwo=&amp;hvqmt=&amp;hvdev=c&amp;hvdvcmdl=&amp;hvlocint=&amp;hvlocphy=9100340&amp;hvtargid=pla-1570391634419&amp;psc=1&amp;language=pt_BR&amp;gad_source=1" rel="noreferrer">Sobre o Sentido da Vida.</a></p>]]></content:encoded></item><item><title><![CDATA[Felicidade autêntica]]></title><description><![CDATA[<p><strong><em>Felicidade Aut&#xEA;ntica</em></strong> &#xE9; um dos livros mais conhecidos do psic&#xF3;logo <strong>Martin Seligman</strong>, considerado o pai da <strong>Psicologia Positiva</strong>. Publicado originalmente em 2002, o livro prop&#xF5;e um novo olhar sobre a felicidade, indo al&#xE9;m do foco tradicional da psicologia em doen&#xE7;as</p>]]></description><link>https://www.matheusgustavo.com.br/felicidade-autentica/</link><guid isPermaLink="false">68c7f049e7a49a5768b7e1ca</guid><category><![CDATA[Bem Estar]]></category><dc:creator><![CDATA[Matheus Gustavo]]></dc:creator><pubDate>Mon, 15 Sep 2025 11:00:08 GMT</pubDate><content:encoded><![CDATA[<p><strong><em>Felicidade Aut&#xEA;ntica</em></strong> &#xE9; um dos livros mais conhecidos do psic&#xF3;logo <strong>Martin Seligman</strong>, considerado o pai da <strong>Psicologia Positiva</strong>. Publicado originalmente em 2002, o livro prop&#xF5;e um novo olhar sobre a felicidade, indo al&#xE9;m do foco tradicional da psicologia em doen&#xE7;as mentais, e buscando entender o que faz a vida valer a pena.</p><p>Seligman apresenta&#xA0;<strong>tr&#xEA;s pilares principais</strong>&#xA0;a serem desenvolvidos &#x2014; e todos s&#xE3;o mais f&#xE1;ceis de medir, desenvolver e aplicar do que a pr&#xF3;pria &#x201C;felicidade&#x201D;, um conceito abstrado e de dif&#xED;cil defini&#xE7;&#xE3;o:</p><p><strong>Emo&#xE7;&#xE3;o Positiva</strong>: Refere-se aos sentimentos de prazer, contentamento e otimismo. Aqui entram os pequenos e grandes prazeres da vida &#x2014; desde saborear um caf&#xE9; quente at&#xE9; celebrar uma conquista.</p><p><strong>Engajamento</strong>&#xA0;(<em>ou flow</em>): &#xC9; aquele estado em que voc&#xEA; est&#xE1; t&#xE3;o imerso em uma atividade que o tempo parece parar. Voc&#xEA; n&#xE3;o est&#xE1; exatamente &#x201C;feliz&#x201D; no momento &#x2014; voc&#xEA; est&#xE1; concentrado, inteiro, presente.</p><p><strong>Significado</strong>: Talvez o mais profundo dos tr&#xEA;s pilares. Trata-se de usar suas qualidades e virtudes pessoais a servi&#xE7;o de algo maior do que voc&#xEA; mesmo &#x2014; seja uma causa, uma f&#xE9;, uma comunidade ou sua pr&#xF3;pria fam&#xED;lia.</p><p>Seligman tamb&#xE9;m descreve&#xA0;<strong>tr&#xEA;s tipos de vida</strong>, e viver bem seria integrar as tr&#xEA;s:</p><p><strong>A Vida Agrad&#xE1;vel</strong>: &#xC9; a busca por emo&#xE7;&#xF5;es positivas &#x2014; alegria, gratid&#xE3;o, prazer. &#xC9; importante, mas sozinha, n&#xE3;o sustenta o bem-estar.</p><p><strong>A Vida Boa</strong>: Vai al&#xE9;m das emo&#xE7;&#xF5;es. Consiste em usar suas&#xA0;<strong>for&#xE7;as pessoais</strong>&#xA0;para obter&#xA0;<strong>gratifica&#xE7;&#xE3;o aut&#xEA;ntica</strong>&#xA0;&#x2014; no trabalho, nas rela&#xE7;&#xF5;es e nas atividades do dia a dia.</p><p><strong>A Vida Significativa</strong>: &#xC9; quando voc&#xEA; usa essas mesmas for&#xE7;as para contribuir com algo maior. &#xC9; aqui que a felicidade se transforma em prop&#xF3;sito &#x2014; e, talvez, em algo sagrado.</p><p><strong>Para saber mais:</strong><br><a href="https://www.amazon.com.br/Felicidade-aut%C3%AAntica-Nova-edi%C3%A7%C3%A3o-psicologia/dp/8547000844/ref=sr_1_1?__mk_pt_BR=%C3%85M%C3%85%C5%BD%C3%95%C3%91&amp;crid=1RW057ZY4PXSS&amp;dib=eyJ2IjoiMSJ9.xZ1wFnzbkKEuZVHcZxhxlusxcrmZsz50TvkPcu9S2q5j3ZPY5tk1DaGezC8CL2UcrbB8EAJLriRGqlSFzKquVv4i7a4pOGS0JJ_lzIwLMjw3z0JZjXIRSGDGcbbZFQBmJMl0FrAEGcUOC4iePT8xK3GiqbpepkMUk0C6nBqeFASRpqvSMBG-E8A2f7INNIOyRzKdp_WjIdAQM0B5KZojys43tShxUhnkVhstkrcE5jEsINBBD0hr3eNK0SQj4bXgzffVsq48hoMKTsxZRl9ysRq8fL3dh-UA2Oew6bxMY1g.dLHDAMPbzHOz9OnQGtODebUBXjYg3I9kwSfzBWSuEgM&amp;dib_tag=se&amp;keywords=felicidade+autentica&amp;qid=1757933913&amp;sprefix=felicidade+autentica%2Caps%2C225&amp;sr=8-1&amp;ufe=app_do%3Aamzn1.fos.6d798eae-cadf-45de-946a-f477d47705b9" rel="noreferrer">Felicidade Aut&#xEA;ntica</a></p>]]></content:encoded></item><item><title><![CDATA[Ruminação]]></title><description><![CDATA[<p>Rumina&#xE7;&#xE3;o &#xE9; o h&#xE1;bito de pensar repetidamente nos mesmos problemas, erros ou situa&#xE7;&#xF5;es negativas, sem chegar a uma solu&#xE7;&#xE3;o. Esse padr&#xE3;o mental faz mal porque alimenta a ansiedade, a depress&#xE3;o, dificulta a tomada de decis&</p>]]></description><link>https://www.matheusgustavo.com.br/ruminacao/</link><guid isPermaLink="false">68c55cc6e7a49a5768b7e18c</guid><category><![CDATA[Bem Estar]]></category><dc:creator><![CDATA[Matheus Gustavo]]></dc:creator><pubDate>Mon, 15 Sep 2025 10:52:00 GMT</pubDate><content:encoded><![CDATA[<p>Rumina&#xE7;&#xE3;o &#xE9; o h&#xE1;bito de pensar repetidamente nos mesmos problemas, erros ou situa&#xE7;&#xF5;es negativas, sem chegar a uma solu&#xE7;&#xE3;o. Esse padr&#xE3;o mental faz mal porque alimenta a ansiedade, a depress&#xE3;o, dificulta a tomada de decis&#xF5;es e aumenta o estresse emocional. O impacto pode ser ainda mais grave quando a rumina&#xE7;&#xE3;o est&#xE1; associada a um padr&#xE3;o explicativo pessimista &#x2014; um estilo de pensamento em que os problemas s&#xE3;o vistos como permanentes, que afetam v&#xE1;rias &#xE1;reas da vida e como sendo culpa exclusivamente sua.<br><br>Para enfrentar a rumina&#xE7;&#xE3;o, &#xE9; &#xFA;til combinar duas abordagens, a distra&#xE7;&#xE3;o e o enfrentamento.<br><br>A <strong>distra&#xE7;&#xE3;o</strong> ajuda a interromper o ciclo repetitivo dos pensamentos. Uma estrat&#xE9;gia eficaz &#xE9; a t&#xE9;cnica PARE: reconhe&#xE7;a que est&#xE1; ruminando, diga mentalmente &#x201C;PARE!&#x201D;, fa&#xE7;a um gesto f&#xED;sico como estalar os dedos e direcione sua aten&#xE7;&#xE3;o para uma nova atividade. Outra forma de mudar o foco &#xE9; observar um objeto em detalhes &#x2013; repare na cor, forma e textura. Coloque a sua aten&#xE7;&#xE3;o no presente.</p><p>Tamb&#xE9;m &#xE9; poss&#xED;vel lidar com os pensamentos escrevendo. Anote o que estiver incomodando, escrever ajuda a aliviar a press&#xE3;o mental e a trazer mais clareza.</p><p>Al&#xE9;m disso, voc&#xEA; pode agendar um hor&#xE1;rio di&#xE1;rio para pensar nas suas preocupa&#xE7;&#xF5;es. Ao longo do dia, quando pensamentos ruminantes surgirem, lembre-se de adi&#xE1;-los para esse momento espec&#xED;fico. Isso reduz a ansiedade e evita que a mente fique presa no problema o tempo todo.</p><p>J&#xE1; o <strong>enfrentamento</strong> envolve olhar diretamente para os pensamentos e question&#xE1;-los. Pergunte a si mesmo: esse pensamento &#xE9; realmente verdadeiro ou &#xE9; s&#xF3; uma suposi&#xE7;&#xE3;o? Existe outra forma de enxergar essa situa&#xE7;&#xE3;o? Esse problema vai parecer t&#xE3;o grande no futuro quanto parece agora? E finalmente, esse pensamento est&#xE1; ajudando em algo ou s&#xF3; est&#xE1; causando sofrimento?</p><p>Quando conseguir uma resposta mais racional, lembre-se dela e use-a sempre que a rumina&#xE7;&#xE3;o surgir.</p><p>Essas duas abordagens se complementam. A distra&#xE7;&#xE3;o ajuda a interromper a rumina&#xE7;&#xE3;o no momento em que ela surge. O enfrentamento, por sua vez, permite lidar com os pensamentos de forma mais racional e pr&#xE1;tica.</p><p><strong>Para saber mais:</strong><br><a href="https://www.amazon.com.br/Aprenda-ser-otimista-mudar-mente/dp/8547000852/ref=sr_1_1?__mk_pt_BR=%C3%85M%C3%85%C5%BD%C3%95%C3%91&amp;crid=241HG9DQ5IN3Z&amp;dib=eyJ2IjoiMSJ9.BbZrvMHKpPLe3i7zEmS4Jbew8Az8kHayqTqGjl_kl5QY7rYaBndGW1iQMqgB5oSVf4G5-kmv8xlRSmO07-N-rAnsI7CHkVr3OTgkRFRqWBO6cfwR-bbUHfLxByOAqJVUDEv8Kmj2kSHG_Gfkba3B8qv-J9_Y_0zXGYu1stvye9ah29CKPDtTEy7dYjb3DGOdJABWyIbITEi2dAZyjrM_U8SKuCMO6I6fSOL3duU_5LWbOBC6rxXwQPXz-9-on7657uZdCwVpmQZxhgMDGAPs1-0jpgjGw1R-OxWkvNCdaEVxhxN2t3QGFifnXiBT9RMIK_RWoEqM8p75JuMyQnO9qJ-_5AOjFm5YyRuKx16o15CbER5gb2NmM8dAGNjpVPnFc8cZlMdPua7rlGDs24ufZkivSfu668SPbMcBC4t_-PDXMLIhBa3zspRNTbDpMXUK.aKqrKNkEcsWJwmNx92EkqRGZ4CQgGiT54A7af_9RMWQ&amp;dib_tag=se&amp;keywords=aprenda+a+ser+otimista&amp;qid=1741768337&amp;sprefix=aprenda+a+ser+otimist%2Caps%2C249&amp;sr=8-1&amp;ufe=app_do%3Aamzn1.fos.6d798eae-cadf-45de-946a-f477d47705b9" rel="noreferrer">Aprenda a ser Otimista</a></p>]]></content:encoded></item><item><title><![CDATA[Otimismo aprendido]]></title><description><![CDATA[<p>No livro&#xA0;<em>Aprenda a Ser Otimista</em>&#xA0;(<em>Learned Optimism</em>), o psic&#xF3;logo Martin Seligman apresenta o conceito de&#xA0;<strong>padr&#xE3;o explicativo</strong>, que &#xE9; a maneira como interpretamos os eventos da vida. Ele identifica tr&#xEA;s dimens&#xF5;es principais desse padr&#xE3;o:</p><p>Um dos</p>]]></description><link>https://www.matheusgustavo.com.br/otimismo-aprendido/</link><guid isPermaLink="false">68c77083e7a49a5768b7e1ba</guid><category><![CDATA[Bem Estar]]></category><dc:creator><![CDATA[Matheus Gustavo]]></dc:creator><pubDate>Mon, 15 Sep 2025 10:50:44 GMT</pubDate><content:encoded><![CDATA[<p>No livro&#xA0;<em>Aprenda a Ser Otimista</em>&#xA0;(<em>Learned Optimism</em>), o psic&#xF3;logo Martin Seligman apresenta o conceito de&#xA0;<strong>padr&#xE3;o explicativo</strong>, que &#xE9; a maneira como interpretamos os eventos da vida. Ele identifica tr&#xEA;s dimens&#xF5;es principais desse padr&#xE3;o:</p><p>Um dos aspectos envolvidos &#xE9; a <strong>perman&#xEA;ncia</strong>, ou seja, a dura&#xE7;&#xE3;o que atribu&#xED;mos a um evento. Pessoas com uma vis&#xE3;o mais pessimista tendem a encarar os momentos dif&#xED;ceis como se fossem permanentes, dizendo coisas como &#x201C;sempre sou ruim nisso&#x201D;. J&#xE1; os otimistas veem os mesmos acontecimentos como passageiros: &#x201C;foi s&#xF3; um contratempo, da pr&#xF3;xima vez ser&#xE1; melhor&#x201D;.</p><p>Outro ponto importante &#xE9; a <strong>abrang&#xEA;ncia</strong>, que se refere &#xE0; tend&#xEA;ncia de generalizar ou isolar um evento. Pessimistas muitas vezes acreditam que um fracasso em uma &#xE1;rea compromete tudo, pensando algo como &#x201C;sou um fracasso em tudo&#x201D;. Em contraste, os otimistas conseguem separar melhor as situa&#xE7;&#xF5;es: &#x201C;falhei nessa tarefa, mas isso n&#xE3;o define quem eu sou, tenho outras qualidades&#x201D;.</p><p>Por fim, h&#xE1; a quest&#xE3;o da <strong>personaliza&#xE7;&#xE3;o</strong>, ou seja, a quem atribu&#xED;mos a culpa quando algo d&#xE1; errado. Quem adota uma postura pessimista costuma culpar a si mesmo, pensando &#x201C;isso aconteceu porque sou incompetente&#x201D;. J&#xE1; os otimistas tendem a considerar fatores externos ou espec&#xED;ficos, como &#x201C;as circunst&#xE2;ncias n&#xE3;o eram favor&#xE1;veis&#x201D;, o que permite uma avalia&#xE7;&#xE3;o mais equilibrada da situa&#xE7;&#xE3;o.</p><p>Adotar uma vis&#xE3;o mais otimista pode levar a maior resili&#xEA;ncia, bem-estar e sucesso em diversas &#xE1;reas da vida.</p><p><strong>Para saber mais:</strong><br><a href="https://www.amazon.com.br/Aprenda-ser-otimista-mudar-mente/dp/8547000852/ref=sr_1_1?__mk_pt_BR=%C3%85M%C3%85%C5%BD%C3%95%C3%91&amp;crid=241HG9DQ5IN3Z&amp;dib=eyJ2IjoiMSJ9.BbZrvMHKpPLe3i7zEmS4Jbew8Az8kHayqTqGjl_kl5QY7rYaBndGW1iQMqgB5oSVf4G5-kmv8xlRSmO07-N-rAnsI7CHkVr3OTgkRFRqWBO6cfwR-bbUHfLxByOAqJVUDEv8Kmj2kSHG_Gfkba3B8qv-J9_Y_0zXGYu1stvye9ah29CKPDtTEy7dYjb3DGOdJABWyIbITEi2dAZyjrM_U8SKuCMO6I6fSOL3duU_5LWbOBC6rxXwQPXz-9-on7657uZdCwVpmQZxhgMDGAPs1-0jpgjGw1R-OxWkvNCdaEVxhxN2t3QGFifnXiBT9RMIK_RWoEqM8p75JuMyQnO9qJ-_5AOjFm5YyRuKx16o15CbER5gb2NmM8dAGNjpVPnFc8cZlMdPua7rlGDs24ufZkivSfu668SPbMcBC4t_-PDXMLIhBa3zspRNTbDpMXUK.aKqrKNkEcsWJwmNx92EkqRGZ4CQgGiT54A7af_9RMWQ&amp;dib_tag=se&amp;keywords=aprenda+a+ser+otimista&amp;qid=1741768337&amp;sprefix=aprenda+a+ser+otimist%2Caps%2C249&amp;sr=8-1&amp;ufe=app_do%3Aamzn1.fos.6d798eae-cadf-45de-946a-f477d47705b9" rel="noreferrer">Aprenda a ser Otimista</a></p>]]></content:encoded></item><item><title><![CDATA[Sofrimento e aceitação]]></title><description><![CDATA[<p>Nosso sofrimento emocional surge do desejo de que as coisas sejam diferentes do que s&#xE3;o. Quando resistimos &#xE0; verdade do que est&#xE1; acontecendo agora, criamos um atrito interno que amplifica nossa dor. Imagine a dor como uma subst&#xE2;ncia gasosa: se permitirmos que ela simplesmente exista,</p>]]></description><link>https://www.matheusgustavo.com.br/sofrimento-e-aceitacao/</link><guid isPermaLink="false">68c55baee7a49a5768b7e17e</guid><category><![CDATA[Bem Estar]]></category><dc:creator><![CDATA[Matheus Gustavo]]></dc:creator><pubDate>Sat, 13 Sep 2025 11:58:13 GMT</pubDate><content:encoded><![CDATA[<p>Nosso sofrimento emocional surge do desejo de que as coisas sejam diferentes do que s&#xE3;o. Quando resistimos &#xE0; verdade do que est&#xE1; acontecendo agora, criamos um atrito interno que amplifica nossa dor. Imagine a dor como uma subst&#xE2;ncia gasosa: se permitirmos que ela simplesmente exista, ela se dissipa naturalmente. Mas se tentarmos confin&#xE1;-la, resistindo e lutando contra ela, a press&#xE3;o aumenta at&#xE9; que exploda.</p><blockquote>&#x201C;O sofrimento resulta de uma &#xFA;nica fonte, a compara&#xE7;&#xE3;o da nossa realidade com os nossos ideais.&#x201D; Kristin Neff</blockquote><p>A pr&#xE1;tica da aten&#xE7;&#xE3;o plena (mindfulness) nos ajuda nesse processo, pois nos ensina a observar nossas emo&#xE7;&#xF5;es sem julgamento. Quando nos permitimos sentir sem resist&#xEA;ncia, criamos espa&#xE7;o para que as emo&#xE7;&#xF5;es dif&#xED;ceis sigam seu curso natural.</p><p>Aceitar a realidade n&#xE3;o significa resignar-se a ela. Pelo contr&#xE1;rio, significa reconhecer o que est&#xE1; presente, sem alimentar ilus&#xF5;es ou nega&#xE7;&#xF5;es. Como diz a Ora&#xE7;&#xE3;o da Serenidade:&#xA0;<em>&quot;Conceda-me a serenidade para aceitar as coisas que n&#xE3;o posso mudar, coragem para mudar as que posso e sabedoria para saber a diferen&#xE7;a.&quot;</em></p><p>Quando aceitamos o que n&#xE3;o podemos mudar e nos tratamos com compaix&#xE3;o, desenvolvemos uma resili&#xEA;ncia mais profunda. Em vez de lutar contra a dor, aprendemos a navegar por ela com suavidade e coragem.</p><p><strong>Para saber mais:</strong><br><a href="https://www.amazon.com.br/Autocompaix%C3%A3o-Pare-Torturar-Deixe-Inseguran%C3%A7a/dp/8566864468/ref=sr_1_1?__mk_pt_BR=%C3%85M%C3%85%C5%BD%C3%95%C3%91&amp;crid=17QTHAK9MKDSL&amp;dib=eyJ2IjoiMSJ9.CQidhBS1XLuLwMjCYbzeNpF5weDdWHEp1gfa4IvcLftzKzTNrnTPVJ7cVgkiOL5nhMaGtmvqIPdbc58um7IiqoGbJ1n9fzT_f7ICafa_goQzDGagIafnJV9L2nJ_pQo5Z_Fj9dCY-SUx0BHoBbiDNQAYAfw2GXoS5hdonSFiwFN-UUWtJdE4LU2G0Ig41cKIZBXqxSTx2nvSFOqgPofqCzOi_EjSV3yIqnT_QxcHKkPjdoZjgdcKHWe-nEKyaxrZyXHOornFeJFAOVdUIEjDbtOFFE1EnFHBAGEuV7Ynjngp46QaEvBSJLqX6BiyQ4Sh6XJifIqFD2H0UM-AOh0RbYDypdumlbS-R-1hKAYUQP2snJU-XkZrPSjFY5ZZPHd5wnwMR9nB4L7WjlkLDgONqA3ehBj1CCX_Kxef_0H2AyBD_2zQRPEDu3j7Yy-T9b7T.SSng51-V0uxOEy42l48y9rvIvBz6fI6ajsOIQFcqJOE&amp;dib_tag=se&amp;keywords=autocompaix%C3%A3o&amp;qid=1741767305&amp;sprefix=auto+compaix%C3%A3o%2Caps%2C209&amp;sr=8-1&amp;ufe=app_do%3Aamzn1.fos.6d798eae-cadf-45de-946a-f477d47705b9">Autocompaix&#xE3;o. Pare de Se Torturar e Deixe a Inseguran&#xE7;a Para Tr&#xE1;s</a></p>]]></content:encoded></item><item><title><![CDATA[Autocompaixão]]></title><description><![CDATA[<p>Vivemos em uma cultura que costuma valorizar o sucesso individual e o desempenho constante. Embora isso possa nos motivar a crescer, tamb&#xE9;m pode contribuir para uma rela&#xE7;&#xE3;o mais dura e exigente com n&#xF3;s mesmos, dificultando a pr&#xE1;tica da gentileza interior.</p><p>Muitas</p>]]></description><link>https://www.matheusgustavo.com.br/autocompaixao/</link><guid isPermaLink="false">68c55529e7a49a5768b7e131</guid><category><![CDATA[Bem Estar]]></category><dc:creator><![CDATA[Matheus Gustavo]]></dc:creator><pubDate>Sat, 13 Sep 2025 11:55:19 GMT</pubDate><content:encoded><![CDATA[<p>Vivemos em uma cultura que costuma valorizar o sucesso individual e o desempenho constante. Embora isso possa nos motivar a crescer, tamb&#xE9;m pode contribuir para uma rela&#xE7;&#xE3;o mais dura e exigente com n&#xF3;s mesmos, dificultando a pr&#xE1;tica da gentileza interior.</p><p>Muitas vezes, surge uma voz interna cr&#xED;tica que tenta nos manter no caminho certo, evitar erros e buscar aceita&#xE7;&#xE3;o. No entanto, esse tipo de autocr&#xED;tica nem sempre nos fortalece &#x2014; em muitos casos, ela nos desgasta emocionalmente e nos distancia do nosso verdadeiro potencial.</p><p>Praticar <strong>autocompaix&#xE3;o</strong> n&#xE3;o &#xE9; sobre fugir das responsabilidades, mas sobre escolher <strong>como</strong> vamos lidar com desafios, dificuldades e perdas &#x2014; com mais compreens&#xE3;o, coragem e humanidade. &#xC9; reconhecer que errar faz parte da vida, e que merecemos o mesmo cuidado que oferecer&#xED;amos a algu&#xE9;m que amamos.</p><blockquote>Aprenda a se apoiar ao inv&#xE9;s de se punir. Kristen Neff</blockquote><p>A autocompaix&#xE3;o envolve tratar-se com a mesma gentileza, paci&#xEA;ncia e compreens&#xE3;o que oferecemos aos outros, especialmente em momentos de dificuldade e os tr&#xEA;s princ&#xED;pios da autocompaix&#xE3;o, definidos pela psic&#xF3;loga Kristin Neff, s&#xE3;o:</p><p><strong>Autobondade</strong>: Tratar-se com compreens&#xE3;o, bondade e cuidado, especialmente quando estamos sofrendo, em vez de ser autocr&#xED;ticos ou duros com n&#xF3;s mesmos. Isso envolve ser gentil com nossos erros e falhas, tratando-se da mesma forma que trataria um amigo.</p><p><strong>Humanidade Comum</strong>: Reconhecer que o sofrimento e as dificuldades s&#xE3;o partes da experi&#xEA;ncia humana compartilhada. Em vez de se isolar ou se sentir &#xFA;nico em seus desafios, a pessoa com autocompaix&#xE3;o entende que todos, em algum momento, passam por momentos dif&#xED;ceis.</p><p><strong>Mindfulness</strong>: Manter uma atitude de consci&#xEA;ncia e aceita&#xE7;&#xE3;o em rela&#xE7;&#xE3;o ao momento presente, sem ignorar ou exagerar as emo&#xE7;&#xF5;es dif&#xED;ceis. Isso significa estar ciente do sofrimento, sem se perder nele ou evitar a dor, e permitindo-se sentir sem julgamento.</p><p>Quando perceber que est&#xE1; se julgando com muita severidade, experimente mudar o pensamento. Em vez de dizer &#x201C;eu sou um fracasso&#x201D;, tente pensar algo como &#x201C;eu estou aprendendo e crescendo&#x201D;. Pequenos gestos de cuidado com n&#xF3;s mesmo tamb&#xE9;m podem ajudar muito nesses momentos &#x2014; colocar a m&#xE3;o no cora&#xE7;&#xE3;o ou se dar um abra&#xE7;o suave, por exemplo, traz um al&#xED;vio importante para o sofrimento. Outra dica &#xE9; adotar um mantra positivo, repetindo frases como &#x201C;Eu me amo e me aceito exatamente como sou&#x201D;.</p><p><strong>Para saber mais:</strong><br><a href="https://www.amazon.com.br/Autocompaix%C3%A3o-Pare-Torturar-Deixe-Inseguran%C3%A7a/dp/8566864468/ref=sr_1_1?__mk_pt_BR=%C3%85M%C3%85%C5%BD%C3%95%C3%91&amp;crid=17QTHAK9MKDSL&amp;dib=eyJ2IjoiMSJ9.CQidhBS1XLuLwMjCYbzeNpF5weDdWHEp1gfa4IvcLftzKzTNrnTPVJ7cVgkiOL5nhMaGtmvqIPdbc58um7IiqoGbJ1n9fzT_f7ICafa_goQzDGagIafnJV9L2nJ_pQo5Z_Fj9dCY-SUx0BHoBbiDNQAYAfw2GXoS5hdonSFiwFN-UUWtJdE4LU2G0Ig41cKIZBXqxSTx2nvSFOqgPofqCzOi_EjSV3yIqnT_QxcHKkPjdoZjgdcKHWe-nEKyaxrZyXHOornFeJFAOVdUIEjDbtOFFE1EnFHBAGEuV7Ynjngp46QaEvBSJLqX6BiyQ4Sh6XJifIqFD2H0UM-AOh0RbYDypdumlbS-R-1hKAYUQP2snJU-XkZrPSjFY5ZZPHd5wnwMR9nB4L7WjlkLDgONqA3ehBj1CCX_Kxef_0H2AyBD_2zQRPEDu3j7Yy-T9b7T.SSng51-V0uxOEy42l48y9rvIvBz6fI6ajsOIQFcqJOE&amp;dib_tag=se&amp;keywords=autocompaix%C3%A3o&amp;qid=1741767305&amp;sprefix=auto+compaix%C3%A3o%2Caps%2C209&amp;sr=8-1&amp;ufe=app_do%3Aamzn1.fos.6d798eae-cadf-45de-946a-f477d47705b9">Autocompaix&#xE3;o. Pare de Se Torturar e Deixe a Inseguran&#xE7;a Para Tr&#xE1;s</a></p>]]></content:encoded></item><item><title><![CDATA[Segurança psicológica]]></title><description><![CDATA[<p>Durante dois anos, o Google realizou uma pesquisa para identificar as principais caracter&#xED;sticas de um time de desenvolvimento de software eficiente. O resultado dessa pesquisa, publicado em 2015, ressalta a import&#xE2;ncia de fatores como seguran&#xE7;a psicol&#xF3;gica, confiabilidade, estrutura e clareza, significado e</p>]]></description><link>https://www.matheusgustavo.com.br/chaves-de-um-time-de-sucesso-seguranca-psicologica/</link><guid isPermaLink="false">65b05bc1c3234b436efca524</guid><category><![CDATA[Sobre Pessoas]]></category><dc:creator><![CDATA[Matheus Gustavo]]></dc:creator><pubDate>Tue, 30 Jan 2024 23:39:00 GMT</pubDate><content:encoded><![CDATA[<p>Durante dois anos, o Google realizou uma pesquisa para identificar as principais caracter&#xED;sticas de um time de desenvolvimento de software eficiente. O resultado dessa pesquisa, publicado em 2015, ressalta a import&#xE2;ncia de fatores como seguran&#xE7;a psicol&#xF3;gica, confiabilidade, estrutura e clareza, significado e impacto para o sucesso de uma equipe.</p><p>A seguran&#xE7;a psicol&#xF3;gica se destaca como o fator mais importante. Ela diz respeito &#xE0; cria&#xE7;&#xE3;o de um ambiente em que os membros da equipe se sintam seguros para correr riscos, serem vulner&#xE1;veis e expressarem suas ideias sem medo de puni&#xE7;&#xE3;o ou constrangimento. Essa seguran&#xE7;a permite a troca aberta de informa&#xE7;&#xF5;es e promove a colabora&#xE7;&#xE3;o entre os membros do time.</p><blockquote>&quot;Seguran&#xE7;a psicol&#xF3;gica &#xE9; a cren&#xE7;a de que n&#xE3;o se ser&#xE1; punido ou humilhado por expor ideias, perguntas, preocupa&#xE7;&#xF5;es ou erros.&quot;<br>Amy Edmondson<br>Harvard Business School Professor</blockquote><p>Ao reconhecer que a base de um time eficiente vai al&#xE9;m de habilidades t&#xE9;cnicas, o estudo do Google destaca um ponto crucial: pessoas s&#xF3; colaboram de verdade quando se sentem seguras. A seguran&#xE7;a psicol&#xF3;gica n&#xE3;o &#xE9; um detalhe &#x2014; &#xE9; o alicerce que sustenta a inova&#xE7;&#xE3;o, o aprendizado e o desempenho coletivo. Investir em um ambiente onde todos possam se expressar com liberdade e respeito &#xE9;, portanto, um passo essencial para construir equipes verdadeiramente fortes e capazes de alcan&#xE7;ar resultados.</p><p>&#xA0;<strong>Para saber mais:</strong></p><p><a href="https://rework.withgoogle.com/intl/en/guides/understanding-team-effectiveness" rel="noreferrer">Understand team effectiveness</a></p>]]></content:encoded></item></channel></rss>